In [2]:
import pandas as pd
import numpy as np
import csv

In [3]:
data={
    'Name':['Ashish','bob',"ee","de","er","dy"],
    'age':[21,23,23,34,56,45],
    'a':[1,2,3,45,5,6],
    'b':[2,9,3,4,5,6],
    'c':[4,5,4,5,6,7],
    'd':[5,6,7,8,9,4],
    'e':[2,3,4,5,6,6]
}
df=pd.DataFrame(data)
print("\nPandas DataFrame:")
print(df)

Pandas DataFrame:
     Name  age   a  b  c  d  e
0  Ashish   21   1  2  4  5  2
1     bob   23   2  9  5  6  3
2      ee   23   3  3  4  7  4
3      de   34  45  4  5  8  5
4      er   56   5  5  6  9  6
5      dy   45   6  6  7  4  6

In [4]:
df.to_csv("a.csv", index=False)

In [3]:
import pandas as pd

data=pd.read_csv("Downloads/nba.csv")
print(data.head())

            Name            Team  Number Position   Age Height  Weight  \
0  Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
1    Jae Crowder  Boston Celtics    99.0       SF  25.0    6-6   235.0
2   John Holland  Boston Celtics    30.0       SG  27.0    6-5   205.0
3    R.J. Hunter  Boston Celtics    28.0       SG  22.0    6-5   185.0
4  Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0

             College     Salary
0              Texas  7730337.0
1          Marquette  6796117.0
2  Boston University        NaN
3      Georgia State  1148640.0
4                NaN  5000000.0

In [6]:
df_read=pd.read_csv("output.csv")
print("\nRead Data from CSv:")
print(df_read.head())

Read Data from CSv:
   Value
0     46
1     94
2      5
3      2
4     86

In [7]:
display(df.tail())

  Name  age   a  b  c  d  e
1  bob   23   2  9  5  6  3
2   ee   23   3  3  4  7  4
3   de   34  45  4  5  8  5
4   er   56   5  5  6  9  6
5   dy   45   6  6  7  4  6

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   age     6 non-null      int64
 2   a       6 non-null      int64
 3   b       6 non-null      int64
 4   c       6 non-null      int64
 5   d       6 non-null      int64
 6   e       6 non-null      int64
dtypes: int64(6), object(1)
memory usage: 468.0+ bytes

In [9]:
df.describe()

             age          a         b         c         d         e
count   6.000000   6.000000  6.000000  6.000000  6.000000  6.000000
mean   33.666667  10.333333  4.833333  5.166667  6.500000  4.333333
std    14.250146  17.084106  2.483277  1.169045  1.870829  1.632993
min    21.000000   1.000000  2.000000  4.000000  4.000000  2.000000
25%    23.000000   2.250000  3.250000  4.250000  5.250000  3.250000
50%    28.500000   4.000000  4.500000  5.000000  6.500000  4.500000
75%    42.250000   5.750000  5.750000  5.750000  7.750000  5.750000
max    56.000000  45.000000  9.000000  7.000000  9.000000  6.000000

In [10]:
df.shape

(6, 7)

In [11]:
df.columns

Index(['Name', 'age', 'a', 'b', 'c', 'd', 'e'], dtype='object')

In [12]:
df.dtypes

Name    object
age      int64
a        int64
b        int64
c        int64
d        int64
e        int64
dtype: object

In [13]:
df.rename(columns={'Name':'Full Name'},inplace=True)
print(df)

  Full Name  age   a  b  c  d  e
0    Ashish   21   1  2  4  5  2
1       bob   23   2  9  5  6  3
2        ee   23   3  3  4  7  4
3        de   34  45  4  5  8  5
4        er   56   5  5  6  9  6
5        dy   45   6  6  7  4  6

In [14]:
df['age']

0    21
1    23
2    23
3    34
4    56
5    45
Name: age, dtype: int64

In [15]:
df[['Full Name','age']]

  Full Name  age
0    Ashish   21
1       bob   23
2        ee   23
3        de   34
4        er   56
5        dy   45

In [16]:
df[df['age']>30]

  Full Name  age   a  b  c  d  e
3        de   34  45  4  5  8  5
4        er   56   5  5  6  9  6
5        dy   45   6  6  7  4  6

In [18]:
df_sorted=df.sort_values(by='age')
print("\nSorted ")
display(df)

Sorted

  Full Name  age   a  b  c  d  e
0    Ashish   21   1  2  4  5  2
1       bob   23   2  9  5  6  3
2        ee   23   3  3  4  7  4
3        de   34  45  4  5  8  5
4        er   56   5  5  6  9  6
5        dy   45   6  6  7  4  6

In [10]:
import pandas as pd
import numpy as np

In [11]:
data={
    'Name':['Ashish','Bhavesh','Devansh','Lakshay','Yash'],
    'Unique_ID':[240409,240426,240434,240408,240957],
    'Age':[21,20,20,18,19],
    'City':['Gurugram','Alwar','Rewari','Rewari','Gurugram'],
    'Group_No':[1,4,6,1,11]
    
}
df=pd.DataFrame(data)
print("\nPandas DataFrame:")
print(df)

Pandas DataFrame:
      Name  Unique_ID  Age      City  Group_No
0   Ashish     240409   21  Gurugram         1
1  Bhavesh     240426   20     Alwar         4
2  Devansh     240434   20    Rewari         6
3  Lakshay     240408   18    Rewari         1
4     Yash     240957   19  Gurugram        11

In [12]:
df.to_csv("q.csv", index=True)

In [15]:
import pandas as pd

# Sample data (replace with your actual data loading)
data = {
    'Title': ['Stranger Things', 'The Crown', 'Inception', 'Parasite', 'Breaking Bad'],
    'Type': ['TV Show', 'TV Show', 'Movie', 'Movie', 'TV Show'],
    'Release_Year': [2016, 2016, 2010, 2019, 2008]
}
df = pd.DataFrame(data)

# Calculate average release year by type
avg_years = df.groupby('Type')['Release_Year'].mean()#.reset_index()
#avg_years.columns = ['Type', 'Average_Release_Year']

# Display the result
print(avg_years)

Type
Movie      2014.500000
TV Show    2013.333333
Name: Release_Year, dtype: float64

In [9]:
import pandas as pd 
df=pd.read_csv("Downloads/employee_data.csv")
display(df)

ParserError: Error tokenizing data. C error: Expected 1 fields in line 3, saw 9